{
 "class_name": "Model",
 "config": {
  "name": "model",
  "layers": [
   {
    "class_name": "InputLayer",
    "config": {
     "batch_input_shape": [
      null,
      18,
      299
     ],
     "dtype": "float32",
     "sparse": false,
     "ragged": false,
     "name": "random_numbers"
    },
    "name": "random_numbers",
    "inbound_nodes": []
   },
   {
    "class_name": "Dense",
    "config": {
     "name": "dense",
     "trainable": true,
     "dtype": "float32",
     "units": 10,
     "activation": "linear",
     "use_bias": true,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    },
    "name": "dense",
    "inbound_nodes": [
     [
      [
       "random_numbers",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "Dense",
    "config": {
     "name": "sum",
     "trainable": true,
     "dtype": "float32",
     "units": 1,
     "activation": "linear",
     "use_bias": true,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    },
    "name": "sum",
    "inbound_nodes": [
     [
      [
       "dense",
       0,
       0,
       {}
      ]
     ]
    ]
   }
  ],
  "input_layers": [
   [
    "random_numbers",
    0,
    0
   ]
  ],
  "output_layers": [
   [
    "sum",
    0,
    0
   ]
  ]
 },
 "keras_version": "2.3.0-tf",
 "backend": "tensorflow"
}